#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>

//int main()
//{
//	//int a = 5 % 2;//除了%操作符之外，其他的几个操作符可以作用于整数和浮点数。
//	printf("%d\n",a);
//	return 0;
//}

//int main()
//{
//	int a = 16;
//	//向右移动
//	//移动的是二进制位
//	//00000000000000000000000000010000 -- 16
//	//00000000000000000000000000001000 -- 8
//	//1.算术右移（通常）
//		//右边丢弃，左边补原符号位
//	//2.逻辑右移
//	    //右边丢弃，左边补0
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//整数的二进制表示有:原码、反码、补码
//	//存储到内存的是补码
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
// 	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	//00000000000000000000000000000101
//	//00000000000000000000000000001010
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	////&
//	//int a = 3;
//	//int b = 5;
//	//int c = a & b;
//	////00000000000000000000000000000011
//	////00000000000000000000000000000101
//	////00000000000000000000000000000001
//	//printf("%d\n", c);
//
//	////|
//	//int a = 3;
//	//int b = 5;
//	//int c = a | b;
//	////00000000000000000000000000000011
//	////00000000000000000000000000000101
//	////00000000000000000000000000000111
//	//printf("%d\n", c);
//
//	//^
//	int a = 3;
//	int b = 5;
//	int c = a ^ b;
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110
//	printf("%d\n", c);
//	return 0;
//}

//交换值
//int main()
//{
//	int a = 3;
//	int b = 5;
//	////加减法 可能溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//
//	//异或法
//	a = a ^ b;//011 101 = 110 = 6 =a
//	b = a ^ b;//110 101 = 011 = 3 =b
//	a = a ^ b;//110 011 = 101 = 5 =b
//	printf("a = %d, b = %d\n", a,b);
//	return 0;
//}

//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//	//统计num的补码中有几个1
//	/*while (num)
//	{
//		if (num%2 ==1)
//		{
//			count++;
//		}
//		num = num / 2;
//
//	}*/
//	int i = 0;
//	for ( i = 0; i < 32; i++)
//	{
//		if ((num >> i) & 1 == 1)
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}

//int main()
//{
//	int num = 0;
//	if (!num)
//	{
//		//num为假，打印
//	}
//	if (num)
//	{
//		//num为真，打印 
//	}
//	printf("%d\n", !num);//真变假，假变真
//	return 0;
//}

int main()
{
	
	return 0;
}