#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>
//int main()
//{
//	int a = 10;//0x00F9F9D0
//	float f = 10.0;//0x00F9F9C4
//	short a = 10.0;
//	short int a = 10.0;
//	return 0;
//}

//void test()
//{
//	printf("hh");
//}
//int main()
//{
//	test(100);
//	return 0;
//}

//int main()
//{
//	int a = 20;
//	//0000000000000000000000000000000000010100 - 原码
//	//0000000000000000000000000000000000010100 - 反码
//	//00000000000000000000000000000000 0001 0100 - 补码
//	//0x00000014
//	int b = -10;
//	//1000000000000000000000000000000000001010 - 原码
//	//1111111111111111111111111111111111110101 - 反码
//	//1111 1111 1111 1111 1111 1111 1111 1111 1111 0110 - 补码
//	//0xFFFFFFF6
//	return 0;
//}

int main()
{
	int a = 20;
	//14 00 00 00 - 小端模式
	//00 00 00 14 - 大端模式
	int b = -10;
	
	return 0;
}